[
  {
    "id": "b1",
    "title": "Credential stuffing compromises customer accounts on thenorthface.com",
    "org": "The North Face (VF Corporation)",
    "date": "2025-04-23",
    "pattern": "Credential stuffing + reused credentials (no enforced MFA)",
    "summary": "Attackers used previously leaked username/password pairs to access a subset of customer accounts. Exposed fields included common profile and order-history attributes; payment data was not exposed because payments are handled by an external provider.",
    "longdesc": "On April 23, 2025, The North Face detected unusual activity on its e-commerce site and investigated immediately. The company concluded an attacker launched an automated credential-stuffing attempt using username/password pairs stolen from unrelated prior breaches and reused by customers. Where the attacker successfully authenticated, they could view account-level data including full name, purchase history, shipping address, email address, date of birth, and telephone number. The North Face stated that payment information was not exposed because a third-party payments provider handles payments and The North Face retains only a token needed for processing. The response included notifying impacted customers and advising password resets and unique passwords to prevent reuse-based takeover.",
    "costUsd": 457760,
    "lossUsd": null,
    "lat": 39.7392,
    "lng": -104.9903,
    "url": "https://www.bleepingcomputer.com/news/security/the-north-face-warns-customers-of-april-credential-stuffing-attack/"
  },
  {
    "id": "b2",
    "title": "Ransomware at printing/data vendor exposes bank customer statements",
    "org": "DBS Group / Bank of China (Singapore) via Toppan Next Tech",
    "date": "2025-04-07",
    "pattern": "Third-party vendor ransomware + document data extraction risk",
    "summary": "A ransomware attack at vendor Toppan Next Tech put printed statements/letters at risk for DBS and Bank of China (Singapore). Banks stated their own systems were not compromised; exposed data related to statement/letter content and customer identifiers handled by the vendor.",
    "longdesc": "On April 5, 2025, DBS was informed by printing vendor Toppan Next Tech (TNT) that TNT had been hit by a ransomware attack; DBS publicly disclosed the incident on April 7. Preliminary investigation indicated statements/letters for about 8,200 DBS customers were potentially compromised, largely tied to DBS Vickers accounts and some Cashline loan accounts. DBS noted it provides files to TNT encrypted and, while the investigation continued, it was not yet known whether the threat actor could decrypt the files at TNT. Data fields that could have been exposed from the statements/letters included customer first and last names, postal addresses, and details relating to equities held and certain loan details; DBS stated the documents did not contain login credentials, passwords, NRIC details, deposit balances, or total wealth holdings. DBS halted printing jobs with TNT, increased monitoring for suspicious activity, and began notifying potentially affected customers. Reuters also reported that Bank of China (Singapore) had around 3,000 affected customers whose paper letters were handled by TNT, with exposure including names, addresses, and in some cases loan account numbers.",
    "costUsd": 1792000,
    "lossUsd": null,
    "lat": 1.3521,
    "lng": 103.8198,
    "url": "https://www.dbs.com/newsroom/DBS_made_aware_of_ransomware_attack_at_printing_vendor_Toppans_systems_affecting_mainly_statements_related_to_DBS_Vickers_accounts"
  },
  {
    "id": "b3",
    "title": "Public S3 bucket exposed Indian bank transfer documents (NACH mandate PDFs)",
    "org": "Unattributed entity (public Amazon S3 bucket; NACH-formatted transaction PDFs)",
    "date": "2025-08-26",
    "pattern": "Cloud storage misconfiguration (public Amazon S3 bucket)",
    "summary": "Researchers found a publicly accessible S3 bucket with 273,000+ transaction PDFs tied to Indian bank transfers. The documents contained unredacted account numbers, amounts, and frequently personal identifiers; the bucket was secured after coordinated notifications and escalation.",
    "longdesc": "On August 26, 2025, UpGuard researchers discovered a publicly accessible Amazon S3 bucket containing roughly 273,000 PDF documents, each documenting a single bank transfer in India and formatted in a way consistent with NACH transaction documentation. The exposed PDFs included unredacted bank account numbers and transaction amounts, and many contained individuals’ names, phone numbers, and email addresses. UpGuard observed the dataset growing over time, with thousands of new documents being added daily. UpGuard’s notification workflow included contacting AYEFin (the most represented entity in the dataset), notifying NPCI (the organization responsible for NACH), and escalating to CERT-In when the exposure continued to expand. UpGuard verified the bucket was secured on September 4, 2025, and later reported NPCI indicated the leak did not originate from NPCI systems. UpGuard published the disclosure on September 25, 2025, with ongoing coverage updates linked from the post.",
    "costUsd": 2510000,
    "lossUsd": null,
    "lat": 28.6139,
    "lng": 77.209,
    "url": "https://www.upguard.com/breaches/india-bank-transfers-data-leak"
  },
  {
    "id": "b4",
    "title": "Oracle E-Business Suite breach impacts Washington Post in broader extortion campaign",
    "org": "The Washington Post",
    "date": "2025-11-06",
    "pattern": "Oracle E-Business Suite compromise + extortion campaign (CL0P-linked reporting)",
    "summary": "The Washington Post confirmed it was impacted by a breach of Oracle E-Business Suite, in reporting tied to a wider extortion-driven campaign against Oracle EBS customers. The campaign involved data theft and extortion emails.",
    "longdesc": "In 2025, a campaign targeting Oracle’s E-Business Suite (EBS) customers involved intrusion activity, data theft, and follow-on extortion communications. Oracle publicly stated that EBS customers had received extortion emails and urged customers to upgrade, noting hackers may have made use of previously identified vulnerabilities. Google separately assessed the campaign’s scale as likely impacting over 100 organizations and involving theft of large volumes of customer data. On November 6, 2025, The Washington Post confirmed it was among those impacted by a breach of the Oracle E-Business Suite platform; Reuters reported that the ransomware/extortion group CL0P had publicly listed the newspaper among its victims. The Washington Post did not provide technical specifics in its statement, consistent with many victim disclosures during extortion campaigns.",
    "costUsd": 10220000,
    "lossUsd": null,
    "lat": 38.9072,
    "lng": -77.0369,
    "url": "https://www.reuters.com/business/media-telecom/washington-post-says-it-is-among-victims-cyber-breach-tied-oracle-software-2025-11-06/"
  },
  {
    "id": "b5",
    "title": "Social engineering via third-party contractor triggers prolonged retail disruption",
    "org": "Marks & Spencer",
    "date": "2025-05-21",
    "pattern": "Third-party entry + social engineering + downstream service disruption",
    "summary": "M&S stated attackers gained access by tricking staff at a third-party contractor, not by directly breaking M&S perimeter defenses. The incident drove sustained operational disruption, including stopping online sales while systems were scanned and restored.",
    "longdesc": "Marks & Spencer disclosed a cyber incident on April 22, 2025, and on May 21 provided further detail on initial access and impact. According to Reuters, M&S said it detected suspicious activity over the Easter weekend of April 19–20 and characterized the time between attacker access and detection as short. M&S stated the attackers were unable to penetrate its systems through direct technical compromise of its digital defenses, so they instead used social engineering to trick employees at a third-party contractor and enter through that third party. Once access was obtained, M&S said the attackers used highly sophisticated techniques. The company responded by stopping online sales and scanning hundreds of systems for damage while progressively restoring services; Reuters reported M&S indicated disruption to online services would persist for months, with full restoration not expected until at least July.",
    "costUsd": 403000000,
    "lossUsd": 403000000,
    "lat": 51.5072,
    "lng": -0.1276,
    "url": "https://www.reuters.com/business/aerospace-defense/ms-says-cyber-hackers-broke-through-third-party-contractor-2025-05-21/"
  },
  {
    "id": "b6",
    "title": "Call-centre platform compromise exposes Qantas customer personal data",
    "org": "Qantas",
    "date": "2025-07-02",
    "pattern": "Third-party customer service platform compromise + large-scale PII exposure",
    "summary": "Qantas reported unauthorized access to a third-party customer service platform used by a call centre. Millions of customer records were affected, with exposed fields varying by individual; Qantas stated no credit card, financial, passport, or login credential data was accessed.",
    "longdesc": "In early July 2025, Qantas reported a cyber incident affecting one of its call centres, where an attacker accessed a third-party customer service platform containing customer personal information. Qantas stated it detected unusual activity on the platform and moved immediately to contain the incident, then conducted forensic analysis with specialist cybersecurity support. In a July 9 update, Qantas reported the impacted system held approximately 5.7 million unique customer records after removing duplicates, and that the specific exposed fields varied by customer. Qantas stated the system did not store credit card details, personal financial information, or passport details, and that passwords, PINs, and login details were not accessed; it also stated there was no direct impact to Frequent Flyer account access because the compromised data was not sufficient to log in. Qantas described the distribution of affected fields at scale (e.g., many records limited to name/email and Frequent Flyer details, while subsets included address, date of birth, phone number, and other profile attributes) and began notifying customers about which data fields were present in their record, alongside establishing support channels and engaging Australian cyber and law enforcement agencies.",
    "costUsd": 2550000,
    "lossUsd": null,
    "lat": -33.8688,
    "lng": 151.2093,
    "url": "https://www.qantasnewsroom.com.au/media-releases/update-on-qantas-cyber-incident-wednesday-9-july-2025"
  },
  {
    "id": "b7",
    "title": "Social-engineering intrusion into insurer network triggers data exposure review",
    "org": "Aflac",
    "date": "2025-06-12",
    "pattern": "Social engineering + unauthorized network access + data review",
    "summary": "Aflac identified suspicious activity and stated the unauthorized party used social engineering to gain access. The intrusion was contained within hours; the company engaged external experts and began reviewing potentially impacted files.",
    "longdesc": "On June 12, 2025, Aflac identified suspicious activity on its U.S. network and initiated its incident response protocols. Aflac stated it stopped the intrusion within hours and that business operations continued, with the incident not involving ransomware impact to systems. In its public disclosure, Aflac said preliminary findings indicated the unauthorized party used social engineering tactics to gain access to the network. The company engaged third-party cybersecurity specialists to support investigation and remediation and began a review of files that may have been accessed or affected to determine whether sensitive customer or employee information was involved. Aflac noted the investigation was in an early stage at the time of disclosure.",
    "costUsd": 10220000,
    "lossUsd": null,
    "lat": 32.461,
    "lng": -84.9877,
    "url": "https://newsroom.aflac.com/2025-06-20-Aflac-Incorporated-Discloses-Cybersecurity-Incident"
  },
  {
    "id": "b8",
    "title": "Unauthorized access exposes personal information from 33.7 million Coupang customer accounts",
    "org": "Coupang",
    "date": "2025-11-18",
    "pattern": "Unauthorized access + prolonged exposure window + suspected insider/retained access reporting",
    "summary": "Coupang reported unauthorized access affecting 33.7 million customer accounts, discovered on November 18. Exposed fields included customer identifiers and certain order history, while payment details and login credentials were not exposed per company statements.",
    "longdesc": "Coupang reported that it learned of a breach on November 18, 2025, involving unauthorized access to personal information associated with 33.7 million customer accounts. Reuters reported Coupang said the exposed data included customer names, email addresses, phone numbers, shipping addresses, and certain order histories, while payment details and login credentials were not exposed; Coupang also reported the unauthorized access was believed to have started earlier in the year and involved overseas servers. The incident prompted South Korean government attention, including an emergency meeting and regulatory review of whether Coupang complied with personal information protection obligations, and public advisories warning customers about follow-on phishing scams. Separate Reuters reporting on subsequent litigation described allegations that the breach involved a former employee who retained access for months prior to discovery, underscoring offboarding/authorization-control risk as a plausible contributing factor in at least some accounts of the incident.",
    "costUsd": 2840000,
    "lossUsd": null,
    "lat": 37.5665,
    "lng": 126.978,
    "url": "https://www.reuters.com/sustainability/boards-policy-regulation/south-korean-e-commerce-firm-coupang-says-337-million-customer-accounts-breached-2025-11-29/"
  }
]